<h1>Import File Pandas</h1>

In [ ]:
import pandas as pd

In [2]:
df = pd.read_csv("players.csv")

<h1> Melihat Semua Dataset </h1>

In [3]:
df

,name_pais,name,tag,rank,expLevel,trophies,name_clan,tag_clan,id_arena,name_arena
0,Afghanistan,f34r,#2UQ99VLU2,1,13,6148,PhatKatz,#G9LGQR,54000015,Master I
1,Afghanistan,Ķìňğ Ãìmãĺ,#QJRU92L,2,13,6005,God of War,#V2RUJ88,54000015,Master I
2,Afghanistan,L☯️I☯️Y☯️A☯️M,#800CLLPU8,3,13,5988,اسیرسرنوشت,#L2CC2L9C,54000015,Master I
3,Afghanistan,FRAIDOON ISHAQ,#9LLLJP8C,4,13,5920,Afghanistan,#PGV80J0P,54000014,Challenger III
4,Afghanistan,⚡king behzad⚡,#P9VLCU8Y9,5,13,5912,Delta Force,#LR8P9L8C,54000014,Challenger III
...,...,...,...,...,...,...,...,...,...,...
167228,Zimbabwe,SethyPlayz,#QQ2U8JCP8,397,2,30,NaN,NaN,54000001,Arena 1
167229,Zimbabwe,kingkong,#R0G2RYCJ2,398,2,30,NaN,NaN,54000001,Arena 1
167230,Zimbabwe,Lord Gargamel,#Y8Y2Y0PV0,399,2,29,NaN,NaN,54000001,Arena 1
167231,Zimbabwe,mattm8,#J089J0YCG,400,2,29,join,#YRUUY0C0,54000001,Arena 1
167232,Zimbabwe,sipoko,#R2U8RG0R8,401,2,28,NaN,NaN,54000001,Arena 1

<h1> Jenis-Jenis Type Data </h1>

In [6]:
df.dtypes

name_pais     object
name          object
tag           object
rank           int64
expLevel       int64
trophies       int64
name_clan     object
tag_clan      object
id_arena       int64
name_arena    object
dtype: object

<h1>Informasi yang didapatkan adalah jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.</h1>

In [13]:
isirecord = len(df)
namaattribute = df.columns
jumlahobjek = len(df.select_dtypes(include=['object']).columns)
jumlahangka = len(df.select_dtypes(include=['int64']).columns)
jumlahnULL = len(df.columns[df.isna().sum() > 0])

dictionary_no1 = {
    "isi record": isirecord,
    "Nama attribute ": namaattribute,
    "Jumlah Objek": jumlahobjek,
    "Jumlah angka": jumlahangka,
    "Jumlah NULL": jumlahnULL,
}

pd.Series(dictionary_no1)

isi record                                                    167233
Nama attribute     Index(['name_pais', 'name', 'tag', 'rank', 'ex...
Jumlah Objek                                                       6
Jumlah angka                                                       4
Jumlah NULL                                                        3
dtype: object

<h1>Tampilkan Nilai rata-rata dengan fungsi mean</h1>

In [14]:
df.select_dtypes(include=['int64' , 'float64']).mean()

rank        4.690107e+02
expLevel    1.185928e+01
trophies    5.262625e+03
id_arena    5.400002e+07
dtype: float64

<h1>Tampilkan Nilai Standar deviasi dengan fungsi std</h1>

In [15]:
df.select_dtypes(include=['int64', 'float64']).std()

rank         291.745275
expLevel       2.070822
trophies    1193.166262
id_arena      11.256253
dtype: float64

<h1> Tampilkan Nilai Minimum dengan fungsi min </h1>

In [31]:
df.select_dtypes(include=['int64', 'float64']).min()

rank               1.0
expLevel           1.0
trophies          23.0
id_arena    54000001.0
dtype: float64

<h1> Tampilkan Nilai Maksimum dengan fungsi max </h1>

In [16]:
df.select_dtypes(include=['int64', 'float64']).max()

rank            1000
expLevel          13
trophies        7408
id_arena    54000056
dtype: int64

<h1>Tampilkan Nilai Q1, Q2, dan Q3 dengan fungsi quantile </h1>

In [17]:
df.select_dtypes(include=['int64', 'float64']).quantile([0.25,0.5,0.75])

       rank  expLevel  trophies    id_arena
0.25  211.0      11.0    5182.0  54000013.0
0.50  454.0      13.0    5609.0  54000014.0
0.75  719.0      13.0    5839.0  54000014.0

<h1> Menampilkan fungsi describe </h1>

In [18]:
df.describe()

                rank       expLevel       trophies      id_arena
count  167233.000000  167233.000000  167233.000000  1.672330e+05
mean      469.010668      11.859280    5262.624847  5.400002e+07
std       291.745275       2.070822    1193.166262  1.125625e+01
min         1.000000       1.000000      23.000000  5.400000e+07
25%       211.000000      11.000000    5182.000000  5.400001e+07
50%       454.000000      13.000000    5609.000000  5.400001e+07
75%       719.000000      13.000000    5839.000000  5.400001e+07
max      1000.000000      13.000000    7408.000000  5.400006e+07

<h1> Tampilkan nilai korelasi attribute bertipe angka </h1>

In [19]:
df.select_dtypes(include=['int64', 'float64']).corr()

              rank  expLevel  trophies  id_arena
rank      1.000000 -0.047208 -0.078044  0.016533
expLevel -0.047208  1.000000  0.925230 -0.002965
trophies -0.078044  0.925230  1.000000  0.071611
id_arena  0.016533 -0.002965  0.071611  1.000000

<h1> Rubah nilai salah satu attribute bertipe angka menjadi dari desimal menjadi bilangan bulat </h1>

In [24]:
df["id_arena"] = df["id_arena"].astype('int64', errors='ignore')
df["id_arena"].dtypes

dtype('int64')

In [25]:
df["id_arena"] = df["id_arena"].astype('float64', errors='ignore')

In [27]:
df = df.fillna(0)
df.id_arena.astype('int64')

0         54000015
1         54000015
2         54000015
3         54000014
4         54000014
            ...
167228    54000001
167229    54000001
167230    54000001
167231    54000001
167232    54000001
Name: id_arena, Length: 167233, dtype: int64

<h1> Tampilkan 10 record pertama dari attribute bertipe angka </h1>

In [28]:
df.select_dtypes(include=['int64', 'float64']).head(10)

   rank  expLevel  trophies    id_arena
0     1        13      6148  54000015.0
1     2        13      6005  54000015.0
2     3        13      5988  54000015.0
3     4        13      5920  54000014.0
4     5        13      5912  54000014.0
5     6        13      5863  54000014.0
6     7        13      5861  54000014.0
7     8        13      5860  54000014.0
8     9        12      5851  54000014.0
9    10        13      5846  54000014.0

<h1> Simpan dataset dengan attribute bertipe angka ke dalam file CSV </h1>

In [32]:
df.select_dtypes(include=['int64', 'float64']).to_csv("bertipe_angka_players.csv", index=False)